<a href="https://colab.research.google.com/github/busung/data-analysis-by-EDA/blob/main/1_%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import seaborn as sns

# 시리즈와 데이터프레임

## 시리즈(Series)

In [ ]:
list_=["Dog","Cat","Tiger","Lion","Monkey"]

In [ ]:
{"0":"Dog","1":"Cat","2":"Tiger","3":"Lion","4":"Monkey"}

{'0': 'Dog', '1': 'Cat', '2': 'Tiger', '3': 'Lion', '4': 'Monkey'}

In [ ]:
{"11":"Dog","12":"Cat","13":"Tiger","14":"Lion","15":"Monkey"}

{'11': 'Dog', '12': 'Cat', '13': 'Tiger', '14': 'Lion', '15': 'Monkey'}

In [ ]:
#Series 생성 연습
ser=pd.Series(list_,index=[11,12,13,14,15])#인덱스 지정
ind_ser=pd.Series({"11":"Dog","12":"Cat","13":"Tiger","14":"Lion","15":"Monkey"})#dic을 이용한 인덱스 지정
print(ser,ind_ser)

11       Dog
12       Cat
13     Tiger
14      Lion
15    Monkey
dtype: object 11       Dog
12       Cat
13     Tiger
14      Lion
15    Monkey
dtype: object

In [ ]:
ser=pd.Series(list_,index=["뭐",12,13,14,15])#index는 꼭 숫자가 아니여도 됨
ser

뭐        Dog
12       Cat
13     Tiger
14      Lion
15    Monkey
dtype: object

In [ ]:
# 튜플로 Series 생성
pd.Series(("이상혁","페이커","미드"),index=["이름","닉네임","포지션"])

이름     이상혁
닉네임    페이커
포지션     미드
dtype: object

## 데이터프레임(DataFrame)

In [ ]:
#dic을 활용한 DataFrame 만들기(열 단위 행렬)
data={"동물":["Dog","Cat","Tiger","Lion","Monkey"],"나이":[5,5,5,5,4]}#value에는 list도 가능하므로
data

{'나이': [5, 5, 5, 5, 4], '동물': ['Dog', 'Cat', 'Tiger', 'Lion', 'Monkey']}

In [ ]:
pd.DataFrame(data)

       동물  나이
0     Dog   5
1     Cat   5
2   Tiger   5
3    Lion   5
4  Monkey   4

In [ ]:
#list를 이용한 DataFrame 만들기(행 단위 행렬)
list_data=[["Dog",5],["Cat",5],["Tiger",5],["Lion",5],["Monkey",4]]
pd.DataFrame(list_data,columns=["동물","나이"])

       동물  나이
0     Dog   5
1     Cat   5
2   Tiger   5
3    Lion   5
4  Monkey   4

In [ ]:
#dict을 이용한 데이터 프레임
dict_data={"account":["Jones LLC","Alpha Co","Blue Inc"],"Jan":[150,200,50],"Feb":[200,210,90],"Mar":[140,215,95]}
pd.DataFrame(dict_data)

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [ ]:
#이중배열을 이용한 데이터 프레임
list_data=[["Jones LLC",150,200,140],["Alpha Co",200,210,215],["Blue Inc",50,90,95]]
pd.DataFrame(list_data,columns=["acoount","Jan","Feb","Mar"])

     acoount  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

#데이터 프레임 조작

##데이터 요약 확인

In [ ]:
tips = sns.load_dataset("tips")
tips.info()#data의 요약정보
tips.head()#상위 5개

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
tips.tail()#하위 5개

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

##행과 열 다루기

##행

In [ ]:
#iloc와loc(i!=index가 아닙니다!)
print(tips.loc[2],tips.iloc[2])
tips1=tips.drop([2])#index가 2인 행을 제거
print(tips1.iloc[2])#iloc는 index가 아닌 데이터의 2번째 행을 지칭
tips1.loc[2]#index가 2인 행을 지칭 그래서 error가 남

total_bill     21.01
tip              3.5
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 2, dtype: object total_bill     21.01
tip              3.5
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 2, dtype: object
total_bill     23.68
tip             3.31
sex             Male
smoker            No
day              Sun
time          Dinner
size               2
Name: 3, dtype: object

KeyError: ignored

In [ ]:
#특정범위 읽어 올 때
tips1.loc[0:3]#slicing 가능

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2

In [ ]:
#특정 행들만 뽑을 떄
tips.loc[[0,140,240]]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
140       17.47  3.50  Female     No  Thur   Lunch     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2

In [ ]:
#특정 열과 행
tips.loc[0:3,['total_bill','day']]

   total_bill  day
0       16.99  Sun
1       10.34  Sun
2       21.01  Sun
3       23.68  Sun

In [ ]:
tips.iloc[0:4,[0,4]]#iloc는 번호로 인덱스가 되어 있어서 loc처럼 이름을 못씀

   total_bill  day
0       16.99  Sun
1       10.34  Sun
2       21.01  Sun
3       23.68  Sun

In [ ]:
tips1.iloc[1,[1]]

tip    1.66
Name: 1, dtype: object

In [ ]:
#조건을 이용한 자료 추출
tips[tips['tip']>5]

     total_bill    tip     sex smoker   day    time  size
23        39.42   7.58    Male     No   Sat  Dinner     4
44        30.40   5.60    Male     No   Sun  Dinner     4
47        32.40   6.00    Male     No   Sun  Dinner     4
52        34.81   5.20  Female     No   Sun  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
85        34.83   5.17  Female     No  Thur   Lunch     4
88        24.71   5.85    Male     No  Thur   Lunch     2
116       29.93   5.07    Male     No   Sun  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
170       50.81  10.00    Male    Yes   Sat  Dinner     3
172        7.25   5.15    Male    Yes   Sun  Dinner     2
181       23.33   5.65    Male    Yes   Sun  Dinner     2
183       23.17   6.50    Male    Yes   Sun  Dinner     4
211       25.89   5.16    Male    Yes   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
214       28.17   6.50  Female    Yes   Sat  Dinner     3
239       29.03   5.92    Male     No   Sat  Dinner     3

In [ ]:
#더 정밀한 추출
tips[(tips['tip']>5) &(tips['day']=='Sun')]#결국 행 기반으로 움직임

     total_bill   tip     sex smoker  day    time  size
44        30.40  5.60    Male     No  Sun  Dinner     4
47        32.40  6.00    Male     No  Sun  Dinner     4
52        34.81  5.20  Female     No  Sun  Dinner     4
116       29.93  5.07    Male     No  Sun  Dinner     4
155       29.85  5.14  Female     No  Sun  Dinner     5
172        7.25  5.15    Male    Yes  Sun  Dinner     2
181       23.33  5.65    Male    Yes  Sun  Dinner     2
183       23.17  6.50    Male    Yes  Sun  Dinner     4

##열

In [ ]:
print(tips['tip'],tips.tip) # 두 개는 동일

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64 0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [ ]:
#특정 열을 가져올 때
tips[['tip','day']]

      tip   day
0    1.01   Sun
1    1.66   Sun
2    3.50   Sun
3    3.31   Sun
4    3.61   Sun
..    ...   ...
239  5.92   Sat
240  2.00   Sat
241  2.00   Sat
242  1.75   Sat
243  3.00  Thur

[244 rows x 2 columns]

In [ ]:
#total이란 새로운 열 생성(total = bill+tips)
tips['total']=tips['total_bill']+tips['tip']#열은 dict형태로 저장되어 있기 때문에 dict처럼 활용하면 된다
tips
#이런걸 파생변수(기존의 데이터를 가지고 새로운 변수를 만든 것)라고 함
#1.기존 데이터를 바탕으로 새로운 데이터 획득을 위해
#2.원본 데이터(raw data)를 보존해야 될 경우 => "재현을 위해"

     total_bill   tip     sex smoker   day    time  size  total
0         16.99  1.01  Female     No   Sun  Dinner     2  18.00
1         10.34  1.66    Male     No   Sun  Dinner     3  12.00
2         21.01  3.50    Male     No   Sun  Dinner     3  24.51
3         23.68  3.31    Male     No   Sun  Dinner     2  26.99
4         24.59  3.61  Female     No   Sun  Dinner     4  28.20
..          ...   ...     ...    ...   ...     ...   ...    ...
239       29.03  5.92    Male     No   Sat  Dinner     3  34.95
240       27.18  2.00  Female    Yes   Sat  Dinner     2  29.18
241       22.67  2.00    Male    Yes   Sat  Dinner     2  24.67
242       17.82  1.75    Male     No   Sat  Dinner     2  19.57
243       18.78  3.00  Female     No  Thur  Dinner     2  21.78

[244 rows x 8 columns]

In [ ]:
#smoker를 문자열로 변경(casting)
#1. 파생변수를 하나 만듬
#2. category를 str로 변경
tips['smoker_setr']=tips['smoker'].astype(str)
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   total_bill   244 non-null    float64
 1   tip          244 non-null    float64
 2   sex          244 non-null    category
 3   smoker       244 non-null    category
 4   day          244 non-null    category
 5   time         244 non-null    category
 6   size         244 non-null    int64
 7   total        244 non-null    float64
 8   smoker_setr  244 non-null    object
dtypes: category(4), float64(3), int64(1), object(1)
memory usage: 11.1+ KB